{
    "Canada": {
        "Nova Scotia": {
            "African Canadian Studies 11": [
                "Diversity and Identity: Understand diversity of Africa/cultures in shaping Canadian identity.",
                "Pre-Colonial History: History of pre-colonial African kingdoms leading to Transatlantic Slave Trade.",
                "Colonial Impact and Resistance: Impact of colonial expansion, enslavement, and resistance.",
                "Research and Communication: Historical research methods and clear communication.",
                "Civil Rights: Persistent struggle of peoples of African descent for equality.",
                "Empowerment: Collective consciousness as a strategy for empowerment."
            ],
            "Canadian History 11": [
                "G1: Pre-contact and post-contact First Nations governing structures.",
                "G2: French, British, and American governing philosophies merging in BNA.",
                "G3: Political and economic structures leading to Confederation.",
                "G4: Evolution of federalism from Confederation to Patriation.",
                "G5: Shift from two-party to multi-party process.",
                "J5: Evolution of the struggle to achieve rights and freedoms."
            ],
            "Contemporary Canadian Studies 11": [
                "Equity Advocacy: How Black Nova Scotians advocate for rights/reforms.",
                "Sustaining Communities: Impacts of encroachment/gentrification on Black communities.",
                "Community Priorities: How individuals/organizations support sustainability.",
                "Systemic Barriers: Impact on education, healthcare, housing, and church support."
            ],
            "Economics 11": [
                "SCO 8: Supply, demand, and price relationship in a market economy.",
                "SCO 10: Business organizations in the Canadian market.",
                "SCO 11: Impact of market structures (monopoly) on consumers.",
                "SCO 12: Role of governments (regulation, taxation) in the market.",
                "SCO 13: Measurement of Canadian economy (GDP)."
            ],
            "Global Sustainable Solutions 12": [
                "Indigenous Relationships: Relationships with land and colonial decisions.",
                "Water Security: Link between sanitation and public health.",
                "Food Security: Factors impacting food production and security.",
                "Disaster Management: Mitigation, preparedness, response, and recovery.",
                "Forced Migration: Conflict-induced and disaster-induced patterns."
            ],
            "Social Studies 7": [
                "Treaty Rights: Impact of policies/denial on Mi'kmaw communities.",
                "Indian Act: Impact on geographic, civic, and economic conditions.",
                "Mi'kmaq Resilience: Response to discriminatory policies.",
                "Resistance: Resisting assimilation and segregation attempts.",
                "Confederation: Impact on Mi'kmaq from multiple perspectives."
            ],
            "Social Studies 8": [
                "Assimilation Policies: Indian Act and residential school system impacts.",
                "Rights Advocacy: 1982 constitution and Truth and Reconciliation.",
                "Inequity Issues: Historical and contemporary injustice in Canada.",
                "First-Voice Perspectives: Understanding issues and inspiring resistance.",
                "Reconciliation: Role and purpose in addressing conflicts."
            ],
            "Sociology 12": [
                "Theories: Functionalism, conflict theory, symbolic interactionism, feminism.",
                "Culture: Core elements (symbols, language, norms, values).",
                "Socialization: Agents that shape the socialization process.",
                "Stratification: Gender, race, and socio-economic status.",
                "Social Control: Formal and informal ways to achieve conformity."
            ],
            "Tourism 11": [
                "Trends in Tourism: Research trends, issues, and innovations."
            ],
            "Citizenship 9": [
                "Engaged Citizenship: Collaboratively-designed service learning projects.",
                "Who Am I?: Citizenship rights of Mi'kmaw and traditionally disempowered people.",
                "Governance: Structure/selection of federal, provincial, indigenous governments."
            ],
            "Law 12": [
                "F5: Impact of Charter of Rights and Freedoms on justice.",
                "CR1: What constitutes a criminal offense in Canada.",
                "AB2: Legal effects of Indian Act (1876) and Constitution Act (1982).",
                "HR2: Safeguarding human rights in Canada."
            ],
            "Mi'kmaw Studies 11": [
                "12: Pre-contact society governance and oral culture.",
                "G4: Nationhood and Treaties (Concordat 1610).",
                "G5: Discriminatory Policies (Indian Act) adverse effects.",
                "E2: Residential Schools traumatizing impacts."
            ]
        }
    },
    "USA": {
        "New York": {
            "Regents US History": [
                "Outcome 1: Sample New York Outcome",
                "Outcome 2: Sample New York Outcome"
            ]
        },
        "California": {
            "Grade 7: World History & Geography": [
                "Belief Systems: Understand how major belief systems and institutions (e.g., Christianity, Islam, Buddhism, Confucianism) shaped political authority, law, social structures, and culture.",
                "Empires & Trade: Analyze how empires and states in Europe, Asia, Africa, and the Americas expanded and interacted through trade, conquest, and diplomacy.",
                "Renaissance & Revolutions: Explain causes, key figures, and consequences of the Renaissance, Reformation, and Scientific Revolution and how they changed ideas about religion, politics, and science.",
                "Geographic Tools: Use geographic tools to explain how location, environment, and resources influenced settlement patterns, trade routes, cultural diffusion, and conflict."
            ],
            "Grade 8: United States History & Geography": [
                "Constitution & Federalism: Describe how the US Constitution established federalism, separation of powers, and rights protections and how early debates shaped parties and policies.",
                "Westward Expansion: Analyze territorial expansion and westward movement, including motives, impacts on Indigenous peoples and slavery, and contributions to sectional tensions.",
                "Civil War: Explain multiple causes of the Civil War and evaluate major events and turning points in the conflict.",
                "Reconstruction: Evaluate the goals, achievements, and limitations of Reconstruction for formerly enslaved people, white Southerners, and other groups."
            ],
            "Grade 9: World and Regional Geography": [
                "Geographic Analysis: Use geographic concepts and tools (location, place, human-environment interaction, movement, region) to analyze patterns of population, resources, and economic activity.",
                "Physical Geography & Human Decisions: Explain how physical geography (landforms, climate, water) and human decisions shape settlement, agriculture, industry, and urbanization.",
                "Contemporary Issues: Evaluate contemporary issues such as migration, resource use, environmental change, and development using geographic reasoning."
            ],
            "Grade 9: Modern California": [
                "Political & Economic Development: Trace political, economic, and demographic developments in California from the late 19th century to the present.",
                "Social Movements: Analyze how California's diverse communities and social movements have shaped law, culture, and public policy.",
                "Civic Challenges: Examine contemporary California challenges (e.g., environment, housing, immigration, technology) and how civic participation addresses them."
            ],
            "Grade 9: Survey of World Religions": [
                "Core Beliefs & Origins: Describe core beliefs, practices, and historical origins of major world religions and ethical systems and how they have influenced societies.",
                "Comparative Perspectives: Compare how religions and belief systems address questions of meaning, morality, and community while emphasizing respect for diverse perspectives.",
                "Religion & Interaction: Analyze historical and contemporary interactions between religion and politics, culture, and conflict."
            ],
            "Grade 10: World History, Culture, & Geography": [
                "Revolutions & Liberty: Analyze how late 18th- and 19th-century revolutions challenged absolutism and spread ideas about liberty, equality, nationalism, and popular sovereignty.",
                "Industrialization: Explain how industrialization transformed production, labor, urban life, and the environment and contributed to imperial expansion.",
                "World Wars: Evaluate causes and consequences of World War I and World War II, including military strategies, home-front mobilization, and civilian impacts.",
                "The Holocaust & Genocide: Describe the Holocaust and other cases of genocide, explaining causes, mechanisms, and international responses.",
                "Decolonization: Analyze decolonization and independence movements in Africa, Asia, and the Middle East and assess their legacies.",
                "Cold War & Interdependence: Explain origins, major crises, and the end of the Cold War and the growth of international organizations and global interdependence."
            ],
            "Grade 11: US History & Geography": [
                "Turn of the 20th Century: Explain how industrialization, immigration, urbanization, and Progressive reforms changed US society and politics.",
                "World War I: Analyze causes and effects of US participation in World War I, including neutrality debates, wartime policies, and postwar internationalism.",
                "Great Depression & New Deal: Evaluate causes of the Great Depression and the goals, programs, and impacts of the New Deal.",
                "World War II: Analyze US involvement in World War II, including reasons for entry, strategies, the home front, and Japanese American internment.",
                "Postwar Developments: Trace postwar developments such as the Cold War, McCarthyism, suburbanization, and their effects on democratic institutions.",
                "Social Movements: Evaluate major civil rights and social movements (African American, women's, Latino, Native American, LGBTQ+, environmental) and their strategies.",
                "Late-20th-Century Transformations: Assess late-20th-century transformations in politics, economics, culture, and technology and the evolving role of the US."
            ],
            "Grade 12: Principles of American Democracy": [
                "Foundations of Democracy: Explain philosophical and historical foundations of the US political system, including classical, Enlightenment, and early American ideas.",
                "Government Structure: Describe the structure and functions of federal and state governments, including separation of powers, checks and balances, and federalism.",
                "Public Policy & Participation: Analyze how public policy is made through elections, legislation, regulation, and bureaucracy and the role of civic participation.",
                "Civil Rights & Liberties: Evaluate protections of civil rights and civil liberties in the Constitution, Bill of Rights, and later amendments through landmark Supreme Court cases.",
                "Civic Influence: Explain ways citizens participate in civic life and assess how participation influences government and policy outcomes."
            ],
            "Grade 12: Economics": [
                "Economic Decision Making: Apply core economic concepts—scarcity, opportunity cost, and marginal analysis—to personal, business, and governmental decisions.",
                "Markets & Prices: Explain how markets allocate resources through supply, demand, and price and analyze the effects of competition.",
                "Mixed Economy Roles: Describe the roles of households, firms, financial institutions, and government in a mixed economy, including taxation and regulation.",
                "Macroeconomic Indicators: Interpret key macroeconomic indicators (GDP, unemployment, inflation) and explain monetary and fiscal policies.",
                "Global Trade: Analyze benefits and costs of international trade, trade agreements, tariffs, exchange rates, and globalization."
            ]
        }
    },
    "UK": {
        "England": {
            "GCSE History": [
                "Outcome 1: Sample UK Outcome",
                "Outcome 2: Sample UK Outcome"
            ]
        }
    }
}